core/app/Http/Controllers/SiteController.php

    public function index()
    {

        $topSellingProducts = Product::topSales(9);
        $featuredProducts   = Product::active()->featured()->where('status', 1)->inRandomOrder()->take(6)->get();
        $latestProducts     = Product::active()->latest()->where('status', 1)->inRandomOrder()->take(12)->get();
        $featuredSeller     = Seller::active()->featured()->whereHas('shop')->with('shop')->inRandomOrder()->take(16)->get();
        $topBrands          = Brand::top()->inRandomOrder()->take(16)->get();
        $pageTitle          = 'Home';
        $offers             = Offer::where('status', 1)->where('end_date', '>', now())
            ->with([
                'products' => function ($q) {
                    return $q->whereHas('categories')->whereHas('brand');
                },
                'products.reviews'
            ])->get();
---
select * from `products` where `status` = 1 and `status` = 1 and `products`.`deleted_at` is null order by `created_at` desc, RAND() limit 12
select * from `sellers` where `featured` = 1 and exists (select * from `shops` where `sellers`.`id` = `shops`.`seller_id`) order by RAND() limit 16
select * from `brands` where `top` = 1 and `brands`.`deleted_at` is null order by RAND() limit 16
select * from `offers` where `status` = 1 and `end_date` > '2024-07-05 16:33:36'