core/app/Http/Controllers/UserController.php

select * from `orders` where `orders`.`user_id` = 3 and `orders`.`user_id` is not null and `payment_status` in (1, 2)
---
    public function home()
    {
        $pageTitle  = 'Dashboard';
        $user       = Auth::user();
        $orders     = $user->orders()->whereIn('payment_status', [1,2])->get();