core/app/Http/Controllers/Admin/AdminController.php

select count(*) as aggregate from `users`
select count(*) as aggregate from `users` where `status` = 1
select count(*) as aggregate from `orders` where `payment_status` != 0 and `status` = 3
select * from `orders` where `payment_status` != 0 order by `created_at` desc limit 6
select sum(`amount`) as aggregate from `deposits` where `status` = 1 and `created_at` >= '2024-06-28 00:00:00'
select sum(`amount`) as aggregate from `deposits` where `status` = 1 and `created_at` >= '2024-06-20 00:00:00'
select sum(`amount`) as aggregate from `deposits` where `status` = 1 and `created_at` >= '2024-06-05 00:00:00'
select sum(`amount`) as aggregate from `deposits` where `status` = 1
select count(*) as aggregate from `sellers`
select count(*) as aggregate from `sellers` where `status` = 1
---
    public function dashboard()
    {
        $pageTitle = 'All Shop\'s Analytics';

        // User Info
        $widget['total_users'] = User::count();
        $widget['verified_users'] = User::where('status', 1)->count();


        $widget['all_orders'] = Order::where('payment_status', '!=', 0)->count();
        $widget['delivered_orders'] = Order::where('payment_status', '!=', 0)->where('status', 3)->count();
        $recent_orders = Order::where('payment_status', '!=', 0)->latest()->take(6)->get();

        $widget['total_product'] = Product::whereHas('brand')->whereHas('categories')->count();

        $widget['last_seven_days'] = Deposit::where('status', 1)->where('created_at', '>=', Carbon::today()->subDays(7))->sum('amount');

        $widget['last_fifteen_days'] = Deposit::where('status', 1)->where('created_at', '>=', Carbon::today()->subDays(15))->sum('amount');

        $widget['last_thirty_days'] = Deposit::where('status', 1)->where('created_at', '>=', Carbon::today()->subDays(30))->sum('amount');

        $widget['top_selling_products'] = Product::topSales(3);
        $widget['total_deposit_amount'] = Deposit::where('status', 1)->sum('amount');
        $widget['total_seller'] = Seller::count();
        $widget['total_active_seller'] = Seller::where('status', 1)->count();

select SUM( CASE WHEN status = 1 THEN amount END) as depositAmount, DATE_FORMAT(created_at,'%M-%Y') as months from `deposits` where `created_at` >= '2023-07-05 19:00:28' and `status` = 1 group by `months` order by `created_at` asc
---
        $report['withdraw_month_amount'] = collect([]);


        $depositsMonth = Deposit::where('created_at', '>=', Carbon::now()->subYear())
            ->where('status', 1)
            ->selectRaw("SUM( CASE WHEN status = 1 THEN amount END) as depositAmount")
            ->selectRaw("DATE_FORMAT(created_at,'%M-%Y') as months")
            ->orderBy('created_at')
            ->groupBy('months')->get();

select SUM( CASE WHEN status = 1 THEN amount END) as withdrawAmount, DATE_FORMAT(created_at,'%M-%Y') as months from `withdrawals` where `created_at` >= '2023-07-05 19:00:28' and `status` = 1 group by `months` order by `created_at` asc
---
            $report['deposit_month_amount']->push(showAmount($depositData->depositAmount));
        });

        $withdrawalMonth = Withdrawal::where('created_at', '>=', Carbon::now()->subYear())->where('status', 1)
            ->selectRaw("SUM( CASE WHEN status = 1 THEN amount END) as withdrawAmount")
            ->selectRaw("DATE_FORMAT(created_at,'%M-%Y') as months")
            ->orderBy('created_at')
            ->groupBy('months')->get();

select sum(amount) as totalAmount, DATE(created_at) day from `withdrawals` where `created_at` >= '2024-06-05 19:00:28' and `status` = 1 group by `day`
---
        }

        // Withdraw Graph
        $withdrawal = Withdrawal::where('created_at', '>=', \Carbon\Carbon::now()->subDays(30))->where('status', 1)
            ->selectRaw('sum(amount) as totalAmount')
            ->selectRaw('DATE(created_at) day')
            ->groupBy('day')->get();

select sum(amount) as totalAmount, DATE(created_at) day from `deposits` where `created_at` >= '2024-06-05 19:00:28' and `status` = 1 group by `day`
---


        // Deposit Graph
        $deposit = Deposit::where('created_at', '>=', \Carbon\Carbon::now()->subDays(30))->where('status', 1)
            ->selectRaw('sum(amount) as totalAmount')
            ->selectRaw('DATE(created_at) day')
            ->groupBy('day')->get();

select `browser`, `os`, `country` from `user_logins` where `created_at` >= '2024-06-05 19:00:28'
---


        // user Browsing, Country, Operating Log
        $userLoginData = UserLogin::where('created_at', '>=', \Carbon\Carbon::now()->subDay(30))->get(['browser', 'os', 'country']);

select sum(`amount`) as aggregate from `deposits` where `status` = 1
select count(*) as aggregate from `deposits` where `status` = 2
select sum(`amount`) as aggregate from `withdrawals` where `status` = 1
select count(*) as aggregate from `withdrawals` where `status` = 2
---
        })->sort()->reverse()->take(5);


        $payment['total_deposit_amount'] = Deposit::where('status', 1)->sum('amount');
        $payment['total_deposit_charge'] = Deposit::where('status', 1)->sum('charge');
        $payment['total_deposit_pending'] = Deposit::where('status', 2)->count();

        $paymentWithdraw['total_withdraw_amount'] = Withdrawal::where('status', 1)->sum('amount');
        $paymentWithdraw['total_withdraw_charge'] = Withdrawal::where('status', 1)->sum('charge');