core/app/Http/Controllers/Admin/ManageOffersController.php

    public function index()
    {
        $pageTitle     = "All Offers";
        $emptyMessage  = "No offer yet";
        $offers         = Offer::paginate(getPaginate());
---
select count(*) as aggregate from `offers`