core/app/Http/Controllers/Admin/ManageUsersController.php

select * from `users` order by `id` desc limit 20 offset 0
select count(*) as aggregate from `users`
---
    public function allUsers()
    {
        $pageTitle = 'All Customers';
        $emptyMessage = 'No customer found';
        $users = User::orderBy('id','desc')->paginate(getPaginate());

select * from `users` where `users`.`id` = '12' limit 1
select sum(`amount`) as aggregate from `deposits` where `user_id` = 12 and `status` = 1
select count(*) as aggregate from `transactions` where `user_id` = 12
select count(*) as aggregate from `orders` where `user_id` = 12 and `payment_status` != 0
---
    public function detail($id)
    {
        $pageTitle          = 'Customer\'s Detail';
        $user               = User::findOrFail($id);
        $totalDeposit       = Deposit::where('user_id', $user->id)->where('status',1)->sum('amount');
        $totalTransaction   = Transaction::where('user_id', $user->id)->count();
        $totalOrders        = Order::where('user_id', $user->id)->where('payment_status', '!=', 0)->count();

select * from `users` where `users`.`id` = '3' limit 1
select * from `user_logins` where `user_logins`.`user_id` = 3 and `user_logins`.`user_id` is not null order by `id` desc limit 20 offset 0
select * from `users` where `users`.`id` in (3)
select count(*) as aggregate from `user_logins` where `user_logins`.`user_id` = 3 and `user_logins`.`user_id` is not null
---
    public function userLoginHistory($id)
    {
        $user = User::findOrFail($id);
        $pageTitle = 'Customer Login History - ' . $user->username;
        $emptyMessage = 'No users login found.';
        $loginLogs = $user->loginLogs()->orderBy('id','desc')->with('user')->paginate(getPaginate());

select * from `users` where `users`.`id` = '5' limit 1
---
    public function showEmailSingleForm($id)
    {
        $user = User::findOrFail($id);

select * from `users` where `users`.`id` = '3' limit 1
delete from `users` where `id` = 3
---
    public function deleteUser($id){
        $user = User::findorFail($id);
        $user->delete();