core/app/Http/Controllers/Admin/OrderController.php

select count(*) as aggregate from `orders` where `payment_status` != 0
---
    public function ordered()
    {
        $pageTitle     = "All Orders";
        $emptyMessage  = 'No order found';
        $query         =  Order::where('payment_status', '!=' ,0);

        if(isset(request()->search)){
            $query->where('order_number', request()->search);
        }

        $orders = $query->with(['user', 'deposit', 'deposit.gateway'])->orderBy('id', 'DESC')->paginate(getPaginate());

select * from `deposits` where `deposits`.`order_id` in (1, 2) order by `created_at` desc
select * from `orders` where `status` = 0 order by `id` desc limit 20 offset 0
select * from `users` where `users`.`id` in (3)
select count(*) as aggregate from `orders` where `status` = 0
---
    public function pending()
    {
        $emptyMessage  = 'No pending order found';
        $pageTitle     = "Pending Orders";
        $query         = Order::where('payment_status', '!=' , 0)->where('status', 0);

        if(isset(request()->search)){
            $query->where('order_number', request()->search);
        }
        $orders        = $query->with(['user', 'deposit', 'deposit.gateway'])->orderBy('id', 'DESC')->paginate(getPaginate());