core/app/Http/Controllers/Admin/ProductStockController.php

select * from `products` where `products`.`id` = '5' and `products`.`deleted_at` is null limit 1
select * from `assign_product_attributes` where `product_id` = '5'
---
    public function stockCreate($product_id)
    {
        $product                = Product::find($product_id);
        if($product->track_inventory == 0){
            $notify[] = ['error', 'Inventory tracking is disabled for this product'];
            return redirect()->back()->withNotify($notify);
        }
        $pageTitle             = 'Manage Inventory';

        $assigned_attributes    = AssignProductAttribute::where('product_id', $product_id)->with(['productAttribute'])->get()->groupBy('product_attribute_id');

select * from `product_stocks` where `product_id` = '5' and `attributes` is null limit 1
---
    public function stockAdd(Request $request, $id)
    {
        $request->validate([
            'attr'          =>'sometimes|required|string',
            'quantity'      =>'required|numeric|min:0',
            'sku'           =>'sometimes|required|string|max:100',
            'type'          =>'required|numeric|between:1,2',
        ]);

        $attributes = $request->attr=='null'?null: $request->attr;

        if($attributes){
            $attributes = json_decode($attributes);
            sort($attributes);
            $attributes = json_encode($attributes);
        }

        if ($request->type == 1) {
            $qty = $request->quantity;
        }else{
            $qty = -$request->quantity;
        }

        $stock = ProductStock::where('product_id', $id)->where('attributes', $attributes)->first();

select * from `products` where (`sku` = '23' and `id` != '5' or exists (select * from `product_stocks` where `products`.`id` = `product_stocks`.`product_id` and `sku` = '23')) and `products`.`deleted_at` is null limit 1
---

        }else{
            //check sku
            $check_sku = Product::where('sku', $request->sku)->where('id', '!=', $id)->with('stocks')->orWhereHas('stocks', function($q)use($request){
                $q->where('sku', $request->sku);
            })->first();

select * from `product_stocks` where `product_stocks`.`id` = '0' limit 1
---
    public function stockLog($id)
    {

        $emptyMessage  = 'Stock log is empty';
        $productStock  = ProductStock::find($id);