core/app/Models/Deposit.php

    public function scopegatewayCurrency()
    {
        return GatewayCurrency::where('method_code', $this->method_code)->where('currency', $this->method_currency)->first();
---
select * from `gateway_currencies` where `method_code` = 109 and `currency` = 'NGN' limit 1