core/app/Models/ProductStock.php

select * from `product_stocks` where `product_id` = '1' and `attributes` = '[\"beans\"]' limit 1
---
    public static function showAvailableStock($productId, $attribute){
        $a = self::where('product_id', $productId)->where('attributes', $attribute)->first();