core/app/Models/Product.php

select products.*, COALESCE(sum(order_details.quantity),0) total from `products` left join `order_details` on `products`.`id` = `order_details`.`product_id` left join `orders` on `order_details`.`order_id` = `orders`.`id` where `orders`.`payment_status` != '0' and `products`.`deleted_at` is null group by `products`.`id` order by `total` desc limit 3
---
    public static function topSales($limit = 6)
    {
        return self::leftJoin('order_details', 'products.id', '=', 'order_details.product_id')
            ->leftJoin('orders', 'order_details.order_id', '=', 'orders.id')
            ->selectRaw('products.*, COALESCE(sum(order_details.quantity),0) total')
            ->where('orders.payment_status', '!=', '0')
            ->groupBy('products.id')
            ->with('reviews')
            ->orderBy('total', 'desc')
            ->limit($limit)
            ->get();