core/app/Traits/CartManager.php

    public function addProductToCart($request)
    {
        $validator = Validator::make($request->all(), [
            'product_id' => 'required|integer|exists:products,id',
            'quantity'  => 'required|numeric',
            'offer_price'  => 'nullable|numeric|gt:0',
        ]);

        if ($validator->fails()) {
            return response()->json($validator->errors());
        }

        $product = Product::findOrFail($request->product_id);
        $user_id = auth()->user()->id ?? null;

        $attributes     = AssignProductAttribute::where('product_id', $request->product_id)->distinct('product_attribute_id')->with('productAttribute')->get(['product_attribute_id']);
---
select * from `products` where `products`.`id` = '1' and `products`.`deleted_at` is null limit 1
select distinct `product_attribute_id` from `assign_product_attributes` where `product_id` = '1'

        }

        if ($user_id != null) {
            $cart = Cart::where('user_id', $user_id)->where('product_id', $request->product_id)->where('attributes', $selected_attr)->first();
---
select * from `carts` where `user_id` = 13 and `product_id` = '1' and `attributes` = '[\"beans\"]' limit 1

                return response()->json(['error' => 'Sorry, You have already added maximum amount of stock']);
            }

            $cart->save();
---
update `carts` set `quantity` = 0, `offer_price` = '500', `carts`.`updated_at` = '2024-07-05 15:20:57' where `id` = 1

    public function deleteCartItem($id)
    {
        if (session()->has('coupon')) {
            return response()->json(['error' => 'You have applied a coupon on your cart. If you want to delete any item form your cart please remove the coupon first.']);
        }

        $cart_item = Cart::findorFail($id);
        $cart_item->delete();
---
select * from `carts` where `carts`.`id` = 2 limit 1
delete from `carts` where `id` = 2

    public function updateCartItem ($request){
        $validator = Validator::make($request->all(), [
            'product_id' => 'required|integer|exists:products,id',
            'quantity'  => 'required|numeric',
            'offer_price'  => 'nullable|numeric|gt:0',
        ]);

        if ($validator->fails()) {
            return response()->json($validator->errors());
        }

        $product = Product::findOrFail($request->product_id);
        $user_id = auth()->user()->id ?? null;

        $attributes     = AssignProductAttribute::where('product_id', $request->product_id)->distinct('product_attribute_id')->with('productAttribute')->get(['product_attribute_id']);
---
select * from `products` where `products`.`id` = '1' and `products`.`deleted_at` is null limit 1
select distinct `product_attribute_id` from `assign_product_attributes` where `product_id` = '1'

        }

        if ($user_id != null) {
            $cart = Cart::where('user_id', $user_id)->where('product_id', $request->product_id)->where('attributes', $selected_attr)->first();
---
select * from `carts` where `user_id` = 1 and `product_id` = '1' and `attributes` = '[\"lg\"]' limit 1

            $cart->product_id = $request->product_id;
            $cart->quantity   = max($request->quantity, 1);
            if ($request->offer_price) $cart->offer_price   = $request->offer_price;
            $cart->save();
---
insert into `carts` (`user_id`, `session_id`, `attributes`, `product_id`, `quantity`, `offer_price`, `updated_at`, `created_at`) values (13, '668d17d00ea9f', '', '1', '1', '500', '2024-07-09 11:58:24', '2024-07-09 11:58:24')