core/app/Traits/OrderManager.php

    public function checkout($request, $type)
    {
        $general = GeneralSetting::first();
---
select * from `general_settings` limit 1