core/app/Traits/ProductManager.php

    public function products($sellerId = 0, $isTrashed = false)
    {
        $search = trim(strtolower(request()->search));
        $query = Product::query();
        if ($sellerId) {
            $query = $query->sellers();
        }

        if (request()->has('recommeded')) {
            $query->inRandomOrder();
        }

        $query = $query->with(['categories', 'brand'])->whereHas('categories', function ($query) {
            if (request()->category) {
                $category = strtolower(request()->category);
                $query->where('categories.name', 'LIKE', "%$category%");
            }
        })->whereHas('brand', function ($query) {
            if (request()->brand) {
                $brand = strtolower(request()->brand);
                $query->where('brands.name', 'LIKE', "%$brand%");
            }
        });
---
select * from `brands` where `brands`.`id` in (1, 2) and `brands`.`deleted_at` is null
select `categories`.*, `products_categories`.`product_id` as `pivot_product_id`, `products_categories`.`category_id` as `pivot_category_id` from `categories` inner join `products_categories` on `categories`.`id` = `products_categories`.`category_id` where `products_categories`.`product_id` in (1, 2) and `categories`.`deleted_at` is null