core/app/Traits/ProductManager.php

select * from `brands` where `brands`.`id` in (2) and `brands`.`deleted_at` is null
select `categories`.*, `products_categories`.`product_id` as `pivot_product_id`, `products_categories`.`category_id` as `pivot_category_id` from `categories` inner join `products_categories` on `categories`.`id` = `products_categories`.`category_id` where `products_categories`.`product_id` in (1) and `categories`.`deleted_at` is null
---
    public function products($sellerId = 0, $isTrashed = false)
    {
        $search = trim(strtolower(request()->search));
        $query  = Product::query();
        if ($sellerId) {
            $query  = $query->sellers();
        }

        if (request()->has('recommeded')) {
            $query->inRandomOrder();
        }

        $query  = $query->with(['categories', 'brand', 'stocks'])->whereHas('categories', function ($query) {
            if (request()->category) {
                $category = strtolower(request()->category);
                $query->where('categories.name', 'LIKE', "%$category%");
            }
        })->whereHas('brand', function ($query) {
            if (request()->brand) {
                $brand = strtolower(request()->brand);
                $query->where('brands.name', 'LIKE', "%$brand%");
            }
        });

select * from `categories` where `parent_id` is null and `categories`.`deleted_at` is null
select * from `brands` where `brands`.`deleted_at` is null order by `name` asc
---
    public function productCreate()
    {
        $data['categories'] = Category::with('allSubcategories')->where('parent_id', null)->get();
        $data['brands']     = Brand::orderBy('name')->get();

select * from `products` where `id` = '5' and `products`.`deleted_at` is null limit 1
select * from `categories` where `parent_id` is null and `categories`.`deleted_at` is null
select * from `brands` where `brands`.`deleted_at` is null order by `name` asc
---
    public function editProduct($id, $sellerId = 0)
    {
        if ($sellerId)
            $data['product']        = Product::where('seller_id', $sellerId)->where('id', $id)->firstOrFail();
        else
            $data['product']        = Product::whereId($id)->first();

        $data['categories']     = Category::with('allSubcategories')->where('parent_id', null)->get();
        $data['brands']         = Brand::orderBy('name')->get();

select * from `products` where `products`.`id` = '5' and `products`.`deleted_at` is null limit 1
---
    public function storeProduct($request, $id, $sellerId = 0)
    {
        $validation_rule = $this->getProductValidationRule($id);
        $request->validate($validation_rule, [
            'specification.*.name.required'   =>  'All specification name is required',
            'specification.*.value'           =>  'All specification value is required',
        ]);

        //Check if the sku is already taken
        if ($request->sku && $this->checkSKU($request->sku, $id)) {
            $notify[] = ['error', 'This SKU has already been taken'];
            return $notify;
        }

        $product = new Product();

        if ($id) {
            $product                = Product::findOrFail($id);

insert into `products` (`status`, `seller_id`, `brand_id`, `sku`, `name`, `model`, `has_variants`, `track_inventory`, `show_in_frontend`, `main_image`, `video_link`, `description`, `summary`, `specification`, `extra_descriptions`, `base_price`, `meta_title`, `meta_description`, `meta_keywords`, `updated_at`, `created_at`) values (0, 13, '1', '23', 'Techno', '', 0, 0, 0, '668d16ec1a3251720522476.jpg', '', '', '', '', '', '20000', '', '', '', '2024-07-09 11:54:36', '2024-07-09 11:54:36')
---
        $product->meta_title        = $request->meta_title;
        $product->meta_description  = $request->meta_description;
        $product->meta_keywords     = $request->meta_keywords ?? null;
        $product->save();

delete from `product_stocks` where `product_stocks`.`product_id` = 5 and `product_stocks`.`product_id` is not null
---
                foreach ($product_stocks->get() as $st) {
                    $st->stockLogs()->delete();
                }
                $product_stocks->delete();

select * from `product_stocks` where `id` = 5 limit 1
---

            // Check stock table to update the sku in stock table
            if ($product->sku) {
                $stock = ProductStock::where('id', $product->id)->first();

select * from `products` where (`sku` = '23' and `id` is not null or exists (select * from `product_stocks` where `products`.`id` = `product_stocks`.`product_id` and `sku` = '23' and `product_id` is not null)) and `products`.`deleted_at` is null limit 1
---
    protected function checkSKU($sku, $id)
    {
        Product::where('sku', $sku)->where('id', '!=', $id)->with('stocks')->orWhereHas('stocks', function ($q) use ($sku, $id) {
            $q->where('sku', $sku)->where('product_id', '!=', $id);
        })->first();