core/app/Http/Helpers/helpers.php

select `active_template` from `general_settings` limit 1
---
function activeTemplate($asset = false)
{
    $general = GeneralSetting::first(['active_template']);

select * from `extensions` where `act` = 'google-analytics' and `status` = 1 limit 1
---
function loadAnalytics()
{
    $analytics = Extension::where('act', 'google-analytics')->where('status', 1)->first();

select * from `extensions` where `act` = 'tawk-chat' and `status` = 1 limit 1
---
function loadTawkto()
{
    $tawkto = Extension::where('act', 'tawk-chat')->where('status', 1)->first();

select * from `general_settings` limit 1
select * from `extensions` where `act` = 'custom-captcha' and `status` = 1 limit 1
---
function loadCustomCaptcha($height = 46, $width = '300px', $bgcolor = '#003', $textcolor = '#abc')
{
    $textcolor = '#' . GeneralSetting::first()->base_color;
    $captcha = Extension::where('act', 'custom-captcha')->where('status', 1)->first();

select * from `general_settings` limit 1
---
function sendEmail($user, $type = null, $shortCodes = [])
{
    $general = GeneralSetting::first();

select * from `frontends` where `data_keys` = 'social_media_links.element' order by `id` desc
---
function getContent($data_keys, $singleQuery = false, $limit = null, $orderById = false)
{
    if ($singleQuery) {
        $content = Frontend::where('data_keys', $data_keys)->orderBy('id', 'desc')->first();