core/app/Http/Controllers/Api/PaymentController.php

    public function store(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'amount' => 'required|numeric|gt:0',
            'method_code' => 'required',
            'currency' => 'required',
        ]);

        if ($validator->fails()) {
            return response()->json([
                'code' => 200,
                'status' => 'ok',
                'message' => ['error' => $validator->errors()->all()],
            ]);
        }

        $user = auth()->user();
        $gate = GatewayCurrency::whereHas('method', function ($gate) {
            $gate->where('status', 1);
        })->where('method_code', $request->method_code)->where('currency', $request->currency)->first();
---
select * from `gateway_currencies` where exists (select * from `gateways` where `gateway_currencies`.`method_code` = `gateways`.`code` and `status` = 1) and `method_code` = '109' and `currency` = 'NGN' limit 1

    public function depositConfirm(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'transaction' => 'required',
        ]);

        if ($validator->fails()) {
            return response()->json([
                'code' => 200,
                'status' => 'ok',
                'message' => ['error' => $validator->errors()->all()],
            ]);
        }
        $deposit = Deposit::where('trx', $request->transaction)->where('status', 0)->orderBy('id', 'DESC')->with('gateway')->first();
---
select * from `deposits` where `trx` = 'JUWG3QGM4NST' and `status` = 0 order by `id` desc limit 1