core/app/Http/Controllers/Api/ProductController.php

    public function single($id){
        $product = Product::where('id', $id)->first();
---
select * from `products` where `id` = '1' and `products`.`deleted_at` is null limit 1