core/app/Http/Controllers/Api/Auth/ForgotPasswordController.php

select * from `users` where `email` = 'mikeross@gmail.com' limit 1
---
    public function sendResetCodeEmail(Request $request)
    {
        if ($request->email) {
            $validationRule = [
                'email'=>'required|email'
            ];
            $validationMessage = [
                'value.required'=>'Email field is required',
                'value.email'=>'Email must be an valide email'
            ];
        }elseif($request->type == 'username'){
            $validationRule = [
                'value'=>'required'
            ];
            $validationMessage = ['value.required'=>'Username field is required'];
        }else{
            return response()->json([
                'code'=>409,
                'status'=>'Failed',
                'message'=>'Invalid request',
            ]);
        }
        $validator = Validator::make($request->all(),$validationRule,$validationMessage);
        if ($validator->fails()) {
            return response()->json([
                'status'=>'Failed',
                'message'=>['error'=>$validator->errors()->all()],
            ], 400);
        }

        $user = User::where('email', $request->email)->first();