core/app/Http/Controllers/Api/Auth/LoginController.php

select * from `user_logins` where `user_ip` = '127.0.0.1' limit 1
---
    public function authenticated(Request $request, $user)
    {
        if ($user->status == 0) {
            auth()->user()->tokens()->delete();
            $notify[] = 'Your account has been deactivated';
            return response()->json([
                'code' => 200,
                'status' => 'ok',
                'message' => ['success' => $notify],
            ]);
        }


        $user = auth('api')->user();
        $user->tv = $user->ts == 1 ? 0 : 1;
        $user->save();
        $ip = $_SERVER["REMOTE_ADDR"];
        $exist = UserLogin::where('user_ip', $ip)->first();

insert into `user_logins` (`longitude`, `latitude`, `city`, `country_code`, `country`, `user_id`, `user_ip`, `browser`, `os`, `updated_at`, `created_at`) values ('', '', '', '', '', 1, '127.0.0.1', 'Unknown Browser', 'Unknown OS Platform', '2024-07-05 13:53:38', '2024-07-05 13:53:38')
---

        $userLogin->browser = @$userAgent['browser'];
        $userLogin->os = @$userAgent['os_platform'];
        $userLogin->save();