core/app/Http/Controllers/Api/Auth/RegisterController.php

    protected function validator(array $data)
    {
        $general = GeneralSetting::first();
---
select * from `general_settings` limit 1

    public function register(Request $request)
    {
        $validator = $this->validator($request->all());
        if ($validator->fails()) {
            return response()->json([
                'code'=>401,
                'status'=>'error',
                'message'=>['error'=>$validator->errors()->all()],
            ]);
        }

        $exist = User::where('mobile',$request->mobile)->first();
---
select * from `users` where `mobile` = '090936573811' limit 1

    protected function create(array $data)
    {

        $general = GeneralSetting::first();

        //User Create
        $user = new User();
        $user->fullname = $data['fullname'];
        $user->email = strtolower(trim($data['email']));
        $user->password = Hash::make($data['password']);
        $user->mobile = $data['mobile'];
        $user->address = $data['address'];
        $user->status = 1;
        $user->ev = $general->ev ? 0 : 1;
        $user->sv = $general->sv ? 0 : 1;
        $user->ts = 0;
        $user->tv = 1;
        $user->save();


        $adminNotification = new AdminNotification();
        $adminNotification->user_id = $user->id;
        $adminNotification->title = 'New member registered';
        $adminNotification->click_url = urlPath('admin.users.detail',$user->id);
        $adminNotification->save();


        //Login Log Create
        $ip = $_SERVER["REMOTE_ADDR"];
        $exist = UserLogin::where('user_ip',$ip)->first();
---
select * from `general_settings` limit 1
insert into `users` (`fullname`, `email`, `password`, `mobile`, `address`, `status`, `ev`, `sv`, `ts`, `tv`, `updated_at`, `created_at`) values ('Mike Doss', 'mike1211@gmail.com', '$2y$10$kTRpx1ShdQ312xeDZ5cdse6yue.FgvoTvhzvRh/.dEB8agdrHmY0K', '090936573811', '{\"address\":\"Lagos, Nigeria\",\"state\":\"\",\"zip\":\"\",\"city\":\"\"}', 1, 0, 1, 0, 1, '2024-07-09 10:14:47', '2024-07-09 10:14:47')
insert into `admin_notifications` (`user_id`, `title`, `click_url`, `updated_at`, `created_at`) values (7, 'New member registered', '/admin/user-detail/7', '2024-07-09 10:14:47', '2024-07-09 10:14:47')
select * from `user_logins` where `user_ip` = '127.0.0.1' limit 1


        $userLogin->browser = @$userAgent['browser'];
        $userLogin->os = @$userAgent['os_platform'];
        $userLogin->save();
---
insert into `user_logins` (`longitude`, `latitude`, `city`, `country_code`, `country`, `user_id`, `user_ip`, `browser`, `os`, `updated_at`, `created_at`) values ('', '', '', '', '', 7, '127.0.0.1', 'Unknown Browser', 'Unknown OS Platform', '2024-07-09 10:14:47', '2024-07-09 10:14:47')