core/app/Http/Controllers/Api/Auth/ResetPasswordController.php

    public function reset(Request $request)
    {

        $validator = Validator::make($request->all(),$this->rules());
        if ($validator->fails()) {
            return response()->json([
                'code'=>409,
                'status'=>'failed',
                'message'=>['error'=>$validator->errors()->all()],
                'data'=>null
            ]);
        }
        $reset = PasswordReset::where('token', $request->token)->orderBy('created_at', 'desc')->first();
        if (!$reset) {
            $notify[] = 'Invalid verification code';
            return response()->json([
                'code'=>200,
                'status'=>'ok',
                'message'=>['error'=>$notify],
            ]);
        }

        $user = User::where('email', $reset->email)->first();
        $user->password = bcrypt($request->password);
        $user->save();
---
select * from `password_resets` where `token` = '440552' order by `created_at` desc limit 1
select * from `users` where `email` = 'mike12111@gmail.com' limit 1
update `users` set `password` = '$2y$10$NBRzmxyLJ4mdLmbqsuSb0uCaS4QuhkjLAu/PWRg89TwdbpXMpFH46', `users`.`updated_at` = '2024-07-10 07:28:45' where `id` = 13

    protected function rules()
    {
        $password_validation = Password::min(6);
        $general = GeneralSetting::first();
---
select * from `general_settings` limit 1